/*
Выравнивание строки заключается в том, что между ее 
отдельными словами  (см. задачу 269)  дополнительно вносятся 
пробелы так, чтобы длина строки стала равной заданной длине  
(предполагается, что требуемая длина не меньше исходной), а 
последнее слово строки сдвинулось к ее правому краю. Составить 
процедуру выравнивания заданной строки текста. 
Решить задачу с помощью макроопределений. Полученные макроопределения должны вызываться как процедуры и не могут использоваться в выражениях.

269. Даны натуральное число n, символы s1, ..., sn. Группы 
символов, разделенные пробелами (одним или несколькими) и не 
содержащие пробелов внутри себя, будем называть словами. 
а) Подсчитать количество слов в данной последовательности. 
б) Подсчитать количество букв а в последнем слове данной 
последовательности. 
в) Найти количество слов, начинающихся с буквы б. 
г) Найти количество слов, у которых первый и последний 
символы совпадают между собой. 
д) Найти какое-нибудь слово, начинающееся с буквы а. 
е) Преобразовать данную последовательность, заменяя каждое 
вхождение слова это на слово то. 
ж) Найти длину самого короткого слова.
*/
