/*
Разработать модуль squnitA для поддержки стеков и очередей целочисленных значений, реализованных на базе массивов.
Заголовочный файл предоставлятся. Создать программу/набор программ для проверки работоспособности всех функций модуля.
Разработать модуль squnitL для поддержки стеков и очередей целочисленных значений,
реализованных на базе односвязных (для стеков) и двусвязных кольцевых (для очередей) списков.
Интерфейс функций модуля squnitL должен полностью соответствовать интерфейсу функций модулея squnitA.
Создать программу/набор программ для проверки работоспособности всех функций модуля.
*/
/*

// Terminal:
> make
> ./main

*/
