/*
Обработка файла растрового изображения (высокоуровневая или низкоуровневая обработка файла)
Дан файл формата BMP, представляющий собой квадратное изображение. Создать программу, которая загружает из переданного ей файла формата BMP заголовки формата, анализирует их, а затем заменяет в исходном файле только те байты, которые позволяют превратить изображение 1 в изображение 2. ЗАПРЕЩЕНА загрузка самого изображения в оперативную память с последующей обработкой.
Изображение 1 - оригинальное изображение
Изображение 2 - перечёркнуторе по диагонали (из угла в угол) изображение
При проверке решения студент имеет право зафиксировать любые параметры формата (версию, палитру, метод кодирования и т.п.). Преподаватель имеет право произвольно задавать содержимое и размер квадратного изображения, а также цвет пересекающихся отрезков.
*/
