/*
Разработать программу, которая по имени системного пользователя возвращает имена его "одногруппников",
то есть пользователей, являющихся членами хотя-бы одной из групп, в которую входит исходный пользователь.

Разработать программу, которая рекурсивно, с использованием функций dirent.h,
выводит в иерархическом представлении содержимое каталога, имя которого ей передано.
Каждый выводимый элемент должен сопровождаться информацией о типе, хозяине, группе, правах доступа.
Если содержимое очередного подкаталога оказывается недоступным - сообщить об этом факте
для каждого каталога и причинах его возникновения.

Разработать программу, которая создает копию переданного ей каталога с любой глубиной вложенности,
с правами на файлы/каталоги, идентичными исходным. Символические ссылки и подкаталоги создаются как есть.
Вместо файлов других типов создаются пустые регулярные файлы.
*/
